data/collected_data/orange/api/standardb12ms/i/load_read.txt
Running 30m test @ http://20.108.20.128:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 17.164ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 16.661ms, rate sampling interval: 68ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.68m     1.18m    4.47m    60.81%
    Req/Sec   445.52     99.12   694.00     69.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.65m 
 75.000%    2.55m 
 90.000%    3.29m 
 99.000%    4.47m 
 99.900%    5.19m 
 99.990%    5.93m 
 99.999%    6.49m 
100.000%    6.53m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.228     0.000000            1         1.00
    5115.903     0.100000       158149         1.11
   25985.023     0.200000       316350         1.25
   51806.207     0.300000       474492         1.43
   76021.759     0.400000       632563         1.67
   98762.751     0.500000       790702         2.00
  109576.191     0.550000       869777         2.22
  120324.095     0.600000       949238         2.50
  131203.071     0.650000      1028207         2.86
  142082.047     0.700000      1107054         3.33
  153223.167     0.750000      1186244         4.00
  159252.479     0.775000      1226331         4.44
  165412.863     0.800000      1265043         5.00
  172359.679     0.825000      1304863         5.71
  179568.639     0.850000      1344170         6.67
  187826.175     0.875000      1384043         8.00
  192282.623     0.887500      1403485         8.89
  197263.359     0.900000      1423324        10.00
  202768.383     0.912500      1443049        11.43
  208666.623     0.925000      1462755        13.33
  214827.007     0.937500      1482671        16.00
  218234.879     0.943750      1492499        17.78
  222035.967     0.950000      1502327        20.00
  226492.415     0.956250      1512100        22.86
  231735.295     0.962500      1522188        26.67
  237371.391     0.968750      1531874        32.00
  240648.191     0.971875      1536858        35.56
  244187.135     0.975000      1541773        40.00
  247988.223     0.978125      1546845        45.71
  251920.383     0.981250      1551765        53.33
  256638.975     0.984375      1556658        64.00
  259391.487     0.985938      1559111        71.11
  262537.215     0.987500      1561565        80.00
  266207.231     0.989062      1564026        91.43
  270008.319     0.990625      1566588       106.67
  273940.479     0.992188      1568982       128.00
  276037.631     0.992969      1570215       142.22
  278396.927     0.993750      1571464       160.00
  281280.511     0.994531      1572684       182.86
  284164.095     0.995313      1573877       213.33
  287834.111     0.996094      1575160       256.00
  289931.263     0.996484      1575779       284.44
  292290.559     0.996875      1576369       320.00
  294649.855     0.997266      1576971       365.71
  297271.295     0.997656      1577577       426.67
  300417.023     0.998047      1578200       512.00
  302776.319     0.998242      1578553       568.89
  304611.327     0.998437      1578847       640.00
  306446.335     0.998633      1579129       731.43
  309067.775     0.998828      1579459       853.33
  311689.215     0.999023      1579741      1024.00
  313262.079     0.999121      1579896      1137.78
  314834.943     0.999219      1580050      1280.00
  316669.951     0.999316      1580217      1462.86
  317980.671     0.999414      1580355      1706.67
  321388.543     0.999512      1580517      2048.00
  324534.271     0.999561      1580589      2275.56
  327155.711     0.999609      1580670      2560.00
  328990.719     0.999658      1580744      2925.71
  331087.871     0.999707      1580822      3413.33
  333971.455     0.999756      1580896      4096.00
  337117.183     0.999780      1580935      4551.11
  340525.055     0.999805      1580973      5120.00
  345243.647     0.999829      1581011      5851.43
  348913.663     0.999854      1581051      6826.67
  353894.399     0.999878      1581088      8192.00
  355467.263     0.999890      1581110      9102.22
  356515.839     0.999902      1581132     10240.00
  357302.271     0.999915      1581146     11702.86
  358875.135     0.999927      1581168     13653.33
  360710.143     0.999939      1581185     16384.00
  362283.007     0.999945      1581198     18204.44
  363069.439     0.999951      1581204     20480.00
  371458.047     0.999957      1581214     23405.71
  378535.935     0.999963      1581224     27306.67
  381157.375     0.999969      1581233     32768.00
  381943.807     0.999973      1581238     36408.89
  384565.247     0.999976      1581243     40960.00
  386138.111     0.999979      1581248     46811.43
  387973.119     0.999982      1581254     54613.33
  388497.407     0.999985      1581258     65536.00
  388759.551     0.999986      1581261     72817.78
  389021.695     0.999988      1581264     81920.00
  389283.839     0.999989      1581269     93622.86
  389283.839     0.999991      1581269    109226.67
  389283.839     0.999992      1581269    131072.00
  389808.127     0.999993      1581272    145635.56
  389808.127     0.999994      1581272    163840.00
  390070.271     0.999995      1581275    187245.71
  390070.271     0.999995      1581275    218453.33
  390070.271     0.999996      1581275    262144.00
  390332.415     0.999997      1581276    291271.11
  390594.559     0.999997      1581279    327680.00
  390594.559     0.999997      1581279    374491.43
  390594.559     0.999998      1581279    436906.67
  390594.559     0.999998      1581279    524288.00
  390594.559     0.999998      1581279    582542.22
  390594.559     0.999998      1581279    655360.00
  390594.559     0.999999      1581279    748982.86
  391118.847     0.999999      1581280    873813.33
  391118.847     0.999999      1581280   1048576.00
  391118.847     0.999999      1581280   1165084.44
  391118.847     0.999999      1581280   1310720.00
  391118.847     0.999999      1581280   1497965.71
  391905.279     0.999999      1581281   1747626.67
  391905.279     1.000000      1581281          inf
#[Mean    =   100989.376, StdDeviation   =    71036.992]
#[Max     =   391643.136, Total count    =      1581281]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1590721 requests in 30.00m, 21.46GB read
  Socket errors: connect 0, read 11148, write 195785, timeout 121838
  Non-2xx or 3xx responses: 530
Requests/sec:    883.73
Transfer/sec:     12.21MB